"""
需求：
    系统时钟频率25MHz，分频系数对应关系如下表。
    PMR递减且PMR最大值不超过65536。
    若期望的时钟周期为x，则PRE和PMR初值配置为多少比较合适？

    |PRE     |0000|0001|0010|0011|0100|0101|0110|0111|
    |--------|----|----|----|----|----|----|----|----|
    |分频因子 |1   |2   |4   |8   |16  |32  |64  |128 |

    |PRE     |1000|1001|1010|1011|1100|0101|1110|1111|
    |--------|----|----|----|----|----|----|----|----|
    |分频因子 |256 |512 |1024|2048|4096|8192|16384|32768|
"""


def get_pmr(x):
    """
        x 为期望的定时器周期
    """
    for pre in range(0,16):
        div = pow(2,pre)
        # x = 1/(25000000/div) * pmr

        pmr = 25000000/div * x
        if(pmr < 65536 and pmr >= 1):
            error = (1/(25000000/div) * round(pmr) - x) / x * 100
            # print(pre,pmr,error)
            yield pre,round(pmr),error

if __name__ == "__main__":

    items = get_pmr(0.001)
    """
        输出为结果为：
        分频配置参数，PMR参数，百分比误差
        例如：
            此处想生成1ms的定时器，计算结果当PRE=4时，误差=-0.032%。
            也即1ms的定时器，实际值要小0.32us。
    """
    print("{:<8s},{:^8s},{:>8s},".format("pre","pmr","err(%)"))
    for item in items:
        print("{:<8d},".format(item[0]),end='')
        print("{:^8d},".format(item[1]),end='')
        print("{:>7.3f}%,".format(item[2]))
