
//-------------------------------
//VS2010：
//带有行号，文件名，函数名的调试信息
//-------------------------------
#ifdef DEBUG
#define DBG(...) fprintf(stderr, "---------------------------------		\
		\r\n\t- Debug -\r\n[File]\t%s\r\n[Func]\t%s()\r\n[Line]\t%d\r\n[Desc]\t", __FILE__, __FUNCTION__, __LINE__); \
		fprintf(stderr, __VA_ARGS__);	\
		fprintf(stderr,"\r\n");			\
		fprintf(stderr,"---------------------------------\r\n")
#else
#define DBG(...)
#endif

//-------------------------------
//		HEX -> ASSIC显示
//用字符表示十六进制数据
//例如：'r'
//HEX_H('r') == '7'
//HEX_L('r') == '2'
//这里都用大写标识，如'M' -> "4D"
//-------------------------------
#define HEX_H(x) ((((x>>4)&0x0f)<=9)?(((x>>4)&0x0f) + 0x30):(((x>>4)&0x0f)-0x0A+0x41))
#define HEX_L(x) ((((x>>0)&0x0f)<=9)?(((x>>0)&0x0f) + 0x30):(((x>>0)&0x0f)-0x0A+0x41))

//-------------------------------
// 还有另一种方式可以实现
//-------------------------------
#define HEX_H(x) ("0123456789ABCDEF"[((x)>>4) & 0x0f])
#define HEX_L(x) ("0123456789ABCDEF"[((x)) & 0x0f])
